Catalogs/упЦветовыеСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упЦветовыеСхемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтображенияМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВыбранногоМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВыделенногоМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильЛинии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упКартинкиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упКартинкиМаркеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыбратьИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПрибытиеВТочкуМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерНачалоРаботВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерУбытиеСТочкиМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеДиспетчеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеОтДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерТочкаПропущена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИзменениеСледующейТочкиПоМаршруту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерОтсутствиеЛицензииНаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КроссДокинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упЦветовыеСхемы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	мсвСтилей = Новый Массив;
	Если ЗначениеЗаполнено(Объект.СтильМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильМаркера);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.СтильВыделенногоМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильВыделенногоМаркера);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.СтильВыбранногоМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильВыбранногоМаркера);
	КонецЕсли;
	
	Если мсвСтилей.Количество() Тогда
		соотКартинки = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(мсвСтилей, "ХранилищеЗначения, Картинка");
		Для каждого текЗначение Из соотКартинки Цикл
			сткРеквизитов = текЗначение.Значение;
			Если текЗначение.Ключ = Объект.СтильМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераИзХранилища;
				Иначе
					КартинкаМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераКартинка;
				КонецЕсли;
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВыделенногоМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВыделенногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераИзХранилища;
				Иначе
					КартинкаВыделенногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераКартинка;
				КонецЕсли;		
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВыбранногоМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВыбранногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераИзХранилища;
				Иначе
					КартинкаВыбранногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераКартинка;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьДляОтображенияМаршрутаПриИзменении(Элемент)
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СтильМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераИзХранилища;
		Иначе
			КартинкаМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВыделенногоМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВыделенногоМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВыделенногоМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВыделенногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераИзХранилища;
		Иначе
			КартинкаВыделенногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВыбранногоМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВыбранногоМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВыбранногоМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВыбранногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераИзХранилища;
		Иначе
			КартинкаВыбранногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимость()          
	
	Элементы.Приоритет.Доступность = Объект.ИспользоватьДляОтображенияМаршрута;
	
КонецПроцедуры // ОбновитьВидимость()

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизитовНаСервере(СтильМаркера)
	
	сткРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтильМаркера, "ХранилищеЗначения, Картинка");
	сткРеквизитов.ХранилищеЗначения = сткРеквизитов.ХранилищеЗначения.Получить();
	
	Возврат сткРеквизитов;
	
КонецФункции // ПолучитьЗначенияРеквизитовНаСервере()

#КонецОбласти
